import { motion } from "framer-motion";
import "./services.scss";
const variants = {
  initial: {
    x: -600,
    y: 100,
    opacity: 0,
  },
  animate: {
    y: 0,
    x: 0,
    opacity: 1,
    transition: {
      duration: 1.2,
      staggerChildren: 0.1,
    },
  },
};
const services = () => {
  return (
    <motion.div
      className="services"
      initial={"initial"}
      whileInView={"animate"}
    >
      <p>
        <br />
      </p>
      <motion.div className="titilecontainer" variants={variants}>
        <div className="title">
          <img
            src="https://www.weresc.com/wp-content/uploads/2023/01/web.jpg"
            alt=""
          />
          <motion.h1>
            <b>طراحی</b> وب سایت
          </motion.h1>
        </div>
        <div className="title">
          <motion.h1>
            <b>برای</b> بیزنس شما!
          </motion.h1>
          <button>ما چیکار میکنیم؟</button>
        </div>
      </motion.div>
      <motion.div className="listcountainer" variants={variants}>
        <motion.div
          className="box"
          whileHover={{
            transform: "translateY(-50px)",
          }}
        >
          <h2>برندها</h2>
          <p>
            لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و
            بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح
            گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و
            ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا
            از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.
            معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و
            بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند
            که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد
            چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته
            شده‌است.
          </p>
          <button>برو</button>
        </motion.div>
        <motion.div
          className="box"
          whileHover={{ transform: "translateY(-50px)" }}
        >
          <h2>برندها</h2>
          <p>
            لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و
            بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح
            گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و
            ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا
            از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.
            معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و
            بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند
            که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد
            چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته
            شده‌است.
          </p>
          <button>برو</button>
        </motion.div>
        <motion.div
          className="box"
          whileHover={{ transform: "translateY(-50px)" }}
        >
          <h2>برندها</h2>
          <p>
            لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و
            بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح
            گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و
            ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا
            از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.
            معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و
            بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند
            که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد
            چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته
            شده‌است.
          </p>
          <button>برو</button>
        </motion.div>
        <motion.div
          className="box"
          whileHover={{ transform: "translateY(-50px)" }}
        >
          <h2>برندها</h2>
          <p>
            لورم ایپسوم یا طرح‌نما (به انگلیسی: Lorem ipsum) به متنی آزمایشی و
            بی‌معنی در صنعت چاپ، صفحه‌آرایی و طراحی گرافیک گفته می‌شود. طراح
            گرافیک از این متن به عنوان عنصری از ترکیب بندی برای پر کردن صفحه و
            ارایه اولیه شکل ظاهری و کلی طرح سفارش گرفته شده استفاده می نماید، تا
            از نظر گرافیکی نشانگر چگونگی نوع و اندازه فونت و ظاهر متن باشد.
            معمولا طراحان گرافیک برای صفحه‌آرایی، نخست از متن‌های آزمایشی و
            بی‌معنی استفاده می‌کنند تا صرفا به مشتری یا صاحب کار خود نشان دهند
            که صفحه طراحی یا صفحه بندی شده بعد از اینکه متن در آن قرار گیرد
            چگونه به نظر می‌رسد و قلم‌ها و اندازه‌بندی‌ها چگونه در نظر گرفته
            شده‌است.
          </p>
          <button>برو</button>
        </motion.div>
      </motion.div>
    </motion.div>
  );
};

export default services;
